# AssetProperties Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperties Class
Members See Also
---
Represents a set of asset property(s).
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AssetProperties : AssetProperty
```

Visual Basic
---
```text
Public Class AssetProperties _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetProperties : public AssetProperty
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetProperties Autodesk.Revit.DB.Visual..::..Asset
# See Also
AssetProperties Members
Autodesk.Revit.DB.Visual Namespace